Repository: leodavidbr/Escala-mais
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Climbing Routes
pt: Rotas de Escalada

source: No routes yet
pt: Nenhuma rota ainda

# tapToCreateFirstRoute
source: Tap the + button to create your first route
pt: Toque no botão + para criar sua primeira rota

source: Error loading routes
pt: Erro ao carregar rotas

source: Retry
pt: Tentar novamente

source: Route Details
pt: Detalhes da Rota

source: Route not found
pt: Rota não encontrada

source: Go Back
pt: Voltar

source: Image not found
pt: Imagem não encontrada

# grade
source: Grade: {grade}
pt: Grau: {grade}

# created
source: Created: {date}
pt: Criado em: {date}

source: Error loading route
pt: Erro ao carregar rota

source: Create Route
pt: Criar Rota

source: No image selected
pt: Nenhuma imagem selecionada

source: Take Photo
pt: Tirar Foto

source: Choose from Gallery
pt: Escolher da Galeria

# pleaseSelectImage
source: Please select an image
pt: Por favor, selecione uma imagem

# error
source: Error: {message}
pt: Erro: {message}

source: Route created successfully!
pt: Rota criada com sucesso!

source: Tap to add photo
pt: Toque para adicionar foto

source: Camera or Gallery
pt: Câmera ou Galeria

source: Route Name *
pt: Nome da Rota *

source: Enter route name
pt: Digite o nome da rota

# pleaseEnterRouteName
source: Please enter a route name
pt: Por favor, digite um nome para a rota

source: Difficulty Grade (Optional)
pt: Grau de Dificuldade (Opcional)

# gradeHint
source: e.g., 5.10a, V4, 6a+
pt: ex.: 5.10a, V4, 6a+

source: Save Route
pt: Salvar Rota

source: Settings
pt: Configurações

# darkModeTitle
source: Dark Mode
pt: Modo Escuro

# darkModeSubtitle
source: Toggle application theme
pt: Alternar o tema do aplicativo

# resetDatabaseTitle
source: Reset Database
pt: Redefinir Banco de Dados

# resetDatabaseSubtitle
source: Delete all saved routes and restore initial data
pt: Apaga todas as rotas salvas e restaura os dados iniciais

# termsOfUseTitle
source: Terms of Use
pt: Termos de Uso

# termsOfUseSubtitle
source: View application terms and policies
pt: Visualizar os termos e políticas do aplicativo

# confirmResetTitle
source: Confirm Reset
pt: Confirmar Redefinição

# confirmResetMessage
source: Are you sure you want to delete all routes and revert to the initial state?
pt: Tem certeza que deseja apagar todas as rotas e reverter para o estado inicial?

# cancelButton
source: Cancel
pt: Cancelar

# resetButton
source: Reset
pt: Redefinir

# closeButton
source: Close
pt: Fechar

# resetSuccess
source: Database successfully reset!
pt: Banco de dados redefinido com sucesso!

# resetFailure
source: Failed to reset database.
pt: Falha ao redefinir o banco de dados.

source: Climbing Gyms
pt: Academias de Escalada

# noGymsYet
source: No gyms registered yet
pt: Nenhuma academia cadastrada

# tapToCreateFirstGym
source: Tap the + button to register the first gym
pt: Toque no botão + para cadastrar a primeira academia

# noLocationProvided
source: Location not provided
pt: Localização não informada

# createGym
source: Register Gym
pt: Cadastrar Academia

source: Gym Name *
pt: Nome da Academia *

source: Enter gym name
pt: Digite o nome da academia

# pleaseEnterGymName
source: Please enter the gym name
pt: Por favor, insira o nome da academia

# gymLocationOptional
source: Location (Optional)
pt: Localização (Opcional)

# enterGymLocation
source: e.g.: New York, NY
pt: Ex.: São Paulo, SP

source: Save Gym
pt: Salvar Academia

# gymCreatedSuccessfully
source: Gym registered successfully!
pt: Academia cadastrada com sucesso!
